Jmeter/results/stress120-20260910-065400/console.log
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using stress-test.jmx
Starting standalone test @ 2026 Sep 10 06:54:01 UTC (1789023241888)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary +      1 in 00:00:01 =    1.8/s Avg:   425 Min:   425 Max:   425 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary +   1507 in 00:00:27 =   55.0/s Avg:   156 Min:    67 Max:   537 Err:     0 (0.00%) Active: 47 Started: 47 Finished: 0
summary =   1508 in 00:00:28 =   53.9/s Avg:   156 Min:    67 Max:   537 Err:     0 (0.00%)
summary +   1838 in 00:00:30 =   61.3/s Avg:   150 Min:    65 Max:  2101 Err:     0 (0.00%) Active: 97 Started: 97 Finished: 0
summary =   3346 in 00:00:58 =   57.7/s Avg:   152 Min:    65 Max:  2101 Err:     0 (0.00%)
summary +   1784 in 00:00:30 =   59.5/s Avg:   207 Min:    62 Max:  3374 Err:     0 (0.00%) Active: 100 Started: 100 Finished: 0
summary =   5130 in 00:01:28 =   58.3/s Avg:   171 Min:    62 Max:  3374 Err:     0 (0.00%)
summary +   1802 in 00:00:30 =   60.1/s Avg:   125 Min:    62 Max:  3082 Err:     0 (0.00%) Active: 100 Started: 100 Finished: 0
summary =   6932 in 00:01:58 =   58.8/s Avg:   159 Min:    62 Max:  3374 Err:     0 (0.00%)
summary +   1793 in 00:00:30 =   59.7/s Avg:   170 Min:    61 Max:  2972 Err:     0 (0.00%) Active: 100 Started: 100 Finished: 0
summary =   8725 in 00:02:28 =   59.0/s Avg:   162 Min:    61 Max:  3374 Err:     0 (0.00%)